# The Candidate Joining Puzzle

Source: https://msbiskills.com/2015/03/23/t-sql-query-the-candidate-joining-puzzle/

In this puzzle we have to find out the valid candidate joining date for each candidate. E.g if you check for CID the joining date is 10-01-2015 and as per the companyâ€™s holiday table they have holiday. So in this case we have to prepone the joining by one day. Hence for CJ10101 the valid joining date would be 08-01-2015 as they have holiday on 09-01-2015 also. Please check out the sample input and expected output for details

In [1]:
%load_ext sql
%sql postgresql://fknight:@localhost/postgres

## The `candidate_joining` table

In [2]:
%%sql

DROP TABLE IF EXISTS candidate_joining;
CREATE TABLE candidate_joining (
    CId          VARCHAR(7) NOT NULL PRIMARY KEY,
    CJoiningDate DATE  NOT NULL
);

INSERT INTO candidate_joining
VALUES 
    ('CJ10101', to_date('10-01-2015', 'DD-MM-YYYY')),
    ('CJ10104', to_date('10-01-2015', 'DD-MM-YYYY')),
    ('CJ10105', to_date('18-02-2015', 'DD-MM-YYYY')),
    ('CJ10121', to_date('11-03-2015', 'DD-MM-YYYY')),
    ('CJ10198', to_date('11-04-2015', 'DD-MM-YYYY'));

SELECT * FROM candidate_joining;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
5 rows affected.
5 rows affected.

[('CJ10101', datetime.date(2015, 1, 10)),
 ('CJ10104', datetime.date(2015, 1, 10)),
 ('CJ10105', datetime.date(2015, 2, 18)),
 ('CJ10121', datetime.date(2015, 3, 11)),
 ('CJ10198', datetime.date(2015, 4, 11))]

# The `holidays` table

In [3]:
%%sql

DROP TABLE IF EXISTS holidays;
CREATE TABLE holidays(
    ID          INTEGER  NOT NULL PRIMARY KEY,
    HolidayDate DATE  NOT NULL
);

INSERT INTO holidays 
VALUES 
    (101, to_date('10-01-2015', 'DD-MM-YYYY')),
    (102, to_date('09-01-2015', 'DD-MM-YYYY')),
    (103, to_date('19-02-2015', 'DD-MM-YYYY')),
    (104, to_date('11-03-2015', 'DD-MM-YYYY')),
    (105, to_date('11-04-2015', 'DD-MM-YYYY'));
    
SELECT * FROM holidays;

 * postgresql://fknight:***@localhost/postgres
Done.
Done.
5 rows affected.
5 rows affected.

[(101, datetime.date(2015, 1, 10)),
 (102, datetime.date(2015, 1, 9)),
 (103, datetime.date(2015, 2, 19)),
 (104, datetime.date(2015, 3, 11)),
 (105, datetime.date(2015, 4, 11))]

## The expected output

|CId    |CJoiningDate|ValidJoiningDate|
|---    |---         |---             |
|CJ10101|10-01-2015  |08-01-2015      |
|CJ10104|10-01-2015  |08-01-2015      |
|CJ10105|18-02-2015  |18-02-2015      |
|CJ10121|11-03-2015  |10-03-2015      |
|CJ10198|11-04-2015  |10-04-2015      |

# Type your SQL below

In [4]:
# %%sql